//CECCUSC1 JOB (ACCOUNT),'CLASSIC JOB',MSGCLASS=X,CLASS=A,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//PROCESS   OUTPUT  DEFAULT=YES,CLASS=*,JESDS=ALL,OUTDISP=HOLD
//*
//* ------------------------------------------------------------------
//*
//* LICENSED MATERIALS - PROPERTY OF IBM
//* 5655-IM1
//* 5655-IM4
//* 5655-IM5
//* 5655-Y18
//*
//* (C) COPYRIGHT IBM CORP.  2003, 2015.  ALL RIGHTS RESERVED.
//* US GOVERNMENT USERS RESTRICTED RIGHTS USE,
//* DUPLICATION OR DISCLOSURE RESTRICTED BY GSA ADP SCHEDULE
//* CONTRACT WITH IBM CORP.
//* DISCLAIMER OF WARRANTIES:
//*
//* PERMISSION IS GRANTED TO COPY AND MODIFY THIS SAMPLE CODE, AND
//* TO DISTRIBUTE MODIFIED VERSIONS PROVIDED THAT BOTH THE COPYRIGHT
//* NOTICE, - AND THIS PERMISSION NOTICE AND WARRANTY DISCLAIMER
//* APPEAR IN ALL COPIES AND MODIFIED VERSIONS.
//*
//* THIS SAMPLE CODE IS LICENSED TO YOU AS-IS.
//* IBM AND ITS SUPPLIERS AND LICENSORS DISCLAIM ALL WARRANTIES,
//* EITHER EXPRESS OR IMPLIED, IN SUCH SAMPLE CODE, INCLUDING THE
//* WARRANTY OF NON-INFRINGEMENT AND THE IMPLIED WARRANTIES OF
//* MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT
//* WILL IBM OR ITS LICENSORS OR SUPPLIERS BE LIABLE FOR ANY DAMAGES
//* ARISING OUT OF THE USE OF OR INABILITY TO USE THE SAMPLE CODE,
//* DISTRIBUTION OF THE SAMPLE CODE, OR COMBINATION OF THE SAMPLE
//* CODE WITH ANY OTHER CODE. IN NO EVENT SHALL IBM OR ITS
//* LICENSORS AND SUPPLIERS BE LIABLE FOR ANY LOST REVENUE, LOST
//* PROFITS OR DATA, OR FOR DIRECT, INDIRECT, SPECIAL, CONSEQUENTIAL,
//* INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS
//* OF THE THEORY OF LIABILITY, EVEN IF IBM OR ITS LICENSORS OR
//* SUPPLIERS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
//*
//* ------------------------------------------------------------------
//*
//*   CECCUSC1 - USER SAMPLES ALLOCATION UTILITY JCL
//*
//*              THIS JCL STREAM IS USED TO CREATE THE USERSAMP
//*              AND USERCONF DATA SETS, WHICH ARE THE CUSTOMIZED
//*              VERSIONS OF THE DISTRIBUTION SCACSAMP AND
//*              SCACCONF DATA SETS, RESPECTIVELY.
//*
//*              IF THE USER DATA SETS ALREADY EXIST THEY WILL BE
//*              REUSED, I.E., NEW DATA SETS WILL NOT BE CREATED.
//*
//*              THE FOLLOWING MEMBERS OF THE USERSAMP DATA SET
//*              ARE CREATED UPON SUCCESSFUL COMPLETION.  IF ANY
//*              MEMBER ALREADY EXISTS, IT IS REPLACED.
//*
//*                CECCUSC2
//*                CECCUSPC
//*
//*
//*   THE FOLLOWING EDITS MUST BE MADE TO RUN THIS UTILITY:
//*
//*     1. PROVIDE A TWO LINE JOB STATEMENT THAT IS VALID FOR YOUR
//*        SITE.
//*
//*     2. CHANGE ALL REFERENCES TO CAC.V11R3M00 TO THE HIGH LEVEL
//*        QUALIFIER OF THE CLASSIC PRODUCTS INSTALLATION DATA
//*        SETS.
//*
//*     3. CHANGE ALL REFERENCES TO USER.V11R3M00 TO THE HIGH
//*        LEVEL QUALIFIER TO ASSIGN TO THE USERSAMP AND USERCONF
//*        DATA SETS TO BE CREATED BY THIS JOB.
//*
//*     4. CHANGE ALL REFERENCES TO <CACDUNIT> TO THE ALLOCATION
//*        UNIT NAME TO BE USED WHEN CREATING NEW DATA SETS.
//*
//*        THIS VALUE MUST BE A VALID UNIT NAME, FOR EXAMPLE,
//*        SYSALLDA.
//*
//*     5. CHANGE ALL REFERENCES TO <CACDVOLM> TO THE VOLUME ID TO
//*        BE USED WHEN TO BE USED WHEN CREATING NEW DATA SETS.
//*
//*        IF A NON-SPECIFIC VOLUME ID IS TO BE USED, THEN THE
//*        REPLACEMENT VALUE FOR <CACDVOLM> MAY BE NULL.
//*
//*        OTHERWISE, SPECIFY A VALID VOLUME ID AS THE REPLACEMENT
//*        VALUE FOR <CACDVOLM> AND UNCOMMENT THE CORRESPONDING
//*        LINE ON THE ISPSTART COMMAND BELOW.
//*
//*     6. AN SMS MANAGEMENT CLASS MAY OPTIONALLY BE SPECIFIED FOR
//*        USE WITH NEW DATA SET ALLOCATIONS.
//*
//*        IF THIS IS DESIRED, CHANGE THE VALUE OF THE <CACMGTCL>
//*        STRING TO THE DESIRED CLASS NAME AND UNCOMMENT THE
//*        CORRESPONDING LINE OF THE ISPSTART COMMAND BELOW.
//*
//*     7. AN SMS STORAGE CLASS MAY OPTIONALLY BE SPECIFIED FOR
//*        USE WITH NEW DATA SET ALLOCATIONS.
//*
//*        IF THIS IS DESIRED, CHANGE THE VALUE OF THE <CACSTGCL>
//*        STRING TO THE DESIRED CLASS NAME AND UNCOMMENT THE
//*        CORRESPONDING LINE OF THE ISPSTART COMMAND BELOW.
//*
//*     8. PROVIDE A PARENTHESIZED LIST OF COMMA SEPARATED VALUES
//*        FOR THE SERVERROLE PARAMETER ON THE ISPSTART COMMAND.
//*
//*        THE SERVERROLE OPERAND MAY NOT CONTAIN ANY EMBEDDED
//*        BLANKS.
//*
//*        THE VALUES CORRESPOND TO THE PRODUCT ROLES TO BE
//*        CONFIGURED AND CUSTOMIZED.
//*
//*        THE VALUE SHOWN IN THIS JCL STREAM IS A REPRESENTATIVE
//*        EXAMPLE (THE EXAMPLE IDENTIFIES ROLE "CDC_IMS_SRC" FOR
//*        PRODUCT "CLASSIC CHANGE DATA CAPTURE FOR Z/OS").
//*
//*     9. CHANGE ALL REFERENCES TO <ISPFHLQ> TO THE HIGH LEVEL
//*        QUALIFIER OF THE ISPF DATA SETS.
//*
//*    10. CHANGE ALL REFERENCES TO <ISPFLANG> TO THE THE
//*        INSTALLATION ISPF LANGUAGE SETTING.
//*
//*        FOR EXAMPLE:
//*           ENU   CORRESPONDS TO US ENGLISH
//*           DEU   CORRESPONDS TO GERMAN
//*
//* ------------------------------------------------------------------
//*
//GENSAMP PROC CAC='CDV113.CAC',      INSTALLED HIGH LEVEL QUALIFIER
//             DISKU='SYSDA',         DASD UNIT
//*            DISKVOL='<CACDVOLM>',  DASD VOLSER
//             ISPHLQ='SYS1',         ISPF HLQ
//             ISPLANG='ENU'          ISPF LANGUAGE
//*
//* ------------------------------------------------------------------
//*
//*  THE CACNOP STEP IS SIMPLY A PLACEHOLDER WHICH REFERENCES ALL
//*  OF THE SYMBOLIC PARAMETERS ON THE PROC STATEMENT.  THIS AVOIDS
//*  RECEIPT OF A JCL ERROR WHEN A SYMBOLIC PARAMETER IS NOT
//*  REFERENCED IN THE PROC.
//*
//CACNOP    EXEC PGM=IEFBR14,
//             PARM='&CAC &DISKU &DISKVOL &ISPHLQ &ISPLANG'
//*
//* ------------------------------------------------------------------
//*
//*  EXECUTE THE USER SAMPLES ALLOCATION UTILITY
//*
//* ------------------------------------------------------------------
//*
//CRTSAMP   EXEC PGM=IKJEFT1A,REGION=0M
//STEPLIB   DD DISP=SHR,DSN=&ISPHLQ..SISPLOAD
//          DD DISP=SHR,DSN=&ISPHLQ..SISPLPA
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSTSPRT  DD SYSOUT=*
//ISPFTTRC  DD SYSOUT=*,DCB=(LRECL=256,RECFM=VB)
//ISPPROF   DD DSN=&&PROF,
//             DISP=(NEW,DELETE),
//             UNIT=&DISKU,
//             SPACE=(CYL,(1,,10)),
//             DCB=(LRECL=80,BLKSIZE=6160,RECFM=FB,DSORG=PO)
//*
//SYSPROC   DD DISP=SHR,DSN=&CAC..SCACSAMP
//ISPTABL   DD DISP=SHR,DSN=&CAC..SCACSAMP
//ISPSLIB   DD DISP=SHR,DSN=&CAC..SCACSKEL
//ISPTLIB   DD DISP=SHR,DSN=&ISPHLQ..SISPT&ISPLANG
//ISPPLIB   DD DISP=SHR,DSN=&ISPHLQ..SISPP&ISPLANG
//ISPMLIB   DD DISP=SHR,DSN=&ISPHLQ..SISPM&ISPLANG
//*
//ISPWRK1   DD DISP=(NEW,DELETE),
//             UNIT=&DISKU,
//             SPACE=(TRK,(15,15)),
//             DCB=(LRECL=256,BLKSIZE=2560,RECFM=FB,DSORG=PS)
//*
//ISPLOG    DD SYSOUT=*,
//             DCB=(RECFM=FBA,BLKSIZE=121,LRECL=121)
//ISPLIST   DD DUMMY,
//             DCB=(RECFM=FBA,BLKSIZE=121,LRECL=121)
//ISPLST1   DD DUMMY,
//             DCB=(RECFM=FBA,BLKSIZE=121,LRECL=121)
//ISPLST2   DD DUMMY,
//             DCB=(RECFM=FBA,BLKSIZE=121,LRECL=121)
//         PEND
//*
//GENSAMPE EXEC GENSAMP
//CRTSAMP.SYSTSIN  DD *
 PROFILE NOPREFIX  MSGID

 ISPSTART CMD(%CACCUSX1                                         +
      CACDUNIT=SYSALLDA                                         +
  /*  CACDVOLM=<CACDVOLM>         UNCOMMENT IF NEEDED  */       +
  /*  CACMGTCL=<CACMGTCL>         UNCOMMENT IF NEEDED  */       +
  /*  CACSTGCL=<CACSTGCL>         UNCOMMENT IF NEEDED  */       +
      CACINHLQ=CDV113.CAC                                       +
      CACUSHLQ=CDV113.CAC.INST1                                 +
      ISPFHLQ=SYS1                                              +
      ISPFLANG=ENU                                              +
      SERVERROLE=(CDC_VSAM_SRC)                                 +
 )
/*
